---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangleCut
source: html/8056ee90-bd7c-702e-1848-18e1029e0331.htm
---
# StructuralSectionConcreteRectangleCut Members

Creates a new instance of Structural Section Concrete Rectangle Cut shape with the associated set of parameters,
 used to attach to structural element.